app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating = 'PG') ORDER BY id
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date
---
  def index
    # defaults
    @hilite_title = "normal"
    @hilite_release = "normal"

 	@all_ratings = Movie.get_ratings
  	@show_ratings = []

  	if params["ratings"] != nil
  	  @show_ratings = params["ratings"].keys
  	end


  	# change defaults if sorting by title or release date
    if (params[:sort_by] == "title")
      @hilite_title = "hilite"
    elsif (params[:sort_by] == "release_date")
      @hilite_release = "hilite"
    else
      params[:sort_by] = "id"
    end


  	if @show_ratings[0] == nil
      @movies = Movie.find(:all, :order => params[:sort_by])
    else
      @movies = Movie.where("rating" => @show_ratings).find(:all, :order => params[:sort_by])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]
---
  def update
    @movie = Movie.find params[:id]